{
  "help_title": "Wire Bundle Diameter Calculator - Help Document",
  "welcome_title": "Welcome to the Wire Bundle Diameter Calculator!",
  "intro_p1": "This tool is a plug-in for estimating the diameter of wire bundles based on a 2D circle packing algorithm. It can help you estimate the final diameter of a wire bundle by simulating calculations based on the input of various wire specifications, number of wrapping layers, and thickness, and provides visualization results and configuration management functions.",
  "toc_title": "Table of Contents",
  "search_placeholder_text": "Search help content...",
  "search_placeholder": "Search help content...",
  "toc_list": "\n                <li><a href=\"#section1\">1. How to launch the plugin</a></li>\n                <li><a href=\"#section2\">2. Main Interface Overview</a>\n                    <ul>\n                        <li><a href=\"#section2-1\">Sidebar</a></li>\n                        <li><a href=\"#section2-2\">Main Content Area</a></li>\n                    </ul>\n                </li>\n                <li><a href=\"#section3\">3. Core Function: Wire Bundle Diameter Calculation (<code>Calculate</code> Page)</a>\n                    <ul>\n                        <li><a href=\"#section3-1\">Interface Layout Overview</a></li>\n                        <li><a href=\"#section3-2\">Left: Parameter Input Area</a></li>\n                        <li><a href=\"#section3-3\">Bottom: Operation Control Bar</a></li>\n                        <li><a href=\"#section3-4\">Right: Result Display Area</a></li>\n                        <li><a href=\"#section3-5\">Quick Calculation Example</a></li>\n                    </ul>\n                </li>\n                <li><a href=\"#section4\">4. View and Manage Calculation History (<code>History</code> Page)</a></li>\n                <li><a href=\"#section5\">5. Plugin Configuration (<code>Config</code> Page)</a></li>\n                <li><a href=\"#section6\">6. View Version and Changelog</a></li>\n                <li><a href=\"#section7\">7. Language and Internationalization</a></li>\n                <li><a href=\"#section8\">8. Viewing and Sharing Results (Export Image)</a></li>\n                <li><a href=\"#section9\">9. Frequently Asked Questions (FAQ)</a></li>\n                <li><a href=\"#section10\">10. Glossary</a></li>\n            ",
  "section1_title": "1. How to launch the plugin",
  "section1_p1": "After installing the plugin, find the \"Wire Bundle Diameter Calculator\" icon (usually a graphic icon) in your browser toolbar and click it. The main interface of the plugin will open in a new pop-up window.",
  "section1_caption1": "<em>This is the plugin icon</em>",
  "section2_title": "2. Main Interface Overview",
  "section2_p1": "The main interface of the plugin is divided into two parts: the left is the <strong>sidebar navigation</strong>, and the right is the <strong>main content area</strong>.",
  "section2_caption1": "<em>This is a schematic diagram showing the layout of the sidebar and the main content area</em>",
  "section2-1_title": "Sidebar",
  "section2-1_content": "\n                <p>The sidebar provides the main navigation functions:</p>\n                <ul>\n                    <li><strong><span class=\"emoji\">🧮</span> Calculate</strong>: Click to enter the core wire bundle diameter calculation page. This is the main functional module of the plugin.</li>\n                    <li><strong><span class=\"emoji\">📜</span> History</strong>: Click to view your past calculation history.</li>\n                    <li><strong><span class=\"emoji\">⚙️</span> Config</strong>: Click to enter the plugin configuration page.</li>\n                    <li><strong>Version Information</strong>: The current version number of the plugin will be displayed at the bottom of the sidebar, for example <code>Version: 1.0.2.2</code>. Click the version number to view the detailed changelog.</li>\n                    <li><strong>Collapse/Expand Button (<code>&lt;</code> or <code>&gt;</code>)</strong>: Located between the sidebar and the main content area, click to collapse or expand the sidebar to provide more space for the content area.</li>\n                </ul>\n            ",
  "section2-2_title": "Main Content Area",
  "section2-2_p1": "The main content area will dynamically display different content according to the options you select in the sidebar. By default, the content of the <strong>\"Calculate\"</strong> page will be displayed after opening the plugin.",
  "section3_title": "3. Core Function: Wire Bundle Diameter Calculation (<code>Calculate</code> Page)",
  "section3_p1": "The \"Calculate\" page is where you enter all wire bundle diameter parameters, perform calculations, and view the results.",
  "section3-1_title": "Interface Layout Overview",
  "section3-1_content": "\n                <p>The calculation page is mainly divided into three areas:</p>\n                <ol>\n                    <li><strong>Left Parameter Input Area</strong>: Used to define the components of the wire bundle, such as wire specifications, quantity, wrapping thickness, etc., and to set calculation-related parameters.</li>\n                    <li><strong>Right Result Display Area</strong>: Used to visualize the simulated cross-section of the wire bundle after calculation, detailed diameter data, and statistical charts.</li>\n                    <li><strong>Bottom Operation Control Bar</strong>: Contains options for performing calculations, resetting the page, and saving history.</li>\n                </ol>\n            ",
  "section3-2_title": "Left: Parameter Input Area",
  "section3-2_p1": "Here, you need to enter all the component information and calculation parameters that make up the wire bundle.",
  "section3-2-1_title": "<span class=\"emoji\">📏</span> Standard Wires",
  "section3-2-1_content": "\n                <p>This area is used to add and manage wires that conform to preset specifications.</p>\n                <h5>Table Column Description:</h5>\n                <ul>\n                    <li><strong>No.</strong>: Automatic numbering.</li>\n                    <li><strong>Wire Gauge</strong>: Select the nominal cross-sectional area of the wire from the drop-down list (e.g., 0.35, 0.5, 0.75 mm², etc.).</li>\n                    <li><strong>Type</strong>: Based on the selected wire gauge, select the insulation layer type of the wire from the drop-down list (e.g., Thin, Thick, UltraThin).</li>\n                    <li><strong>Diameter (mm)</strong>: This field will be automatically filled with the nominal outer diameter of the wire of this specification based on the \"Wire Gauge\" and \"Type\" you selected.</li>\n                    <li><strong>Quantity</strong>: Enter the number of wires of this specification in the wire bundle.</li>\n                    <li><strong>Delete</strong>: Click the \"<span class=\"emoji\">❌</span>\" button to delete this row of wires.</li>\n                </ul>\n                <h5>Operation Buttons:</h5>\n                <ul>\n                    <li><strong><span class=\"emoji\">✨</span> Add</strong>: Click to add a new standard wire input row.</li>\n                    <li><strong><span class=\"emoji\">🔄</span> Reset</strong>: Click to restore the standard wire table to its default initial state (usually a few rows of preset common specifications with a quantity of 0).</li>\n                </ul>\n                <h5>How to use:</h5>\n                <ol>\n                    <li>Click the \"<span class=\"emoji\">✨</span> Add\" button to add a wire row.</li>\n                    <li>In each row, select the appropriate wire gauge from the \"Wire Gauge\" drop-down box.</li>\n                    <li>Next, select the corresponding insulation layer type from the \"Type\" drop-down box, and the \"Diamet",
  "section3-2-2_title": "<span class=\"emoji\">🔗</span> Special Wires",
  "section3-2-2_content": "\n                <p>If your wire bundle contains wires that are not pre-configured in the \"Standard Wires\" list, you can add them here.</p>\n                 <h5>Table Column Description:</h5>\n                <ul>\n                    <li><strong>No.</strong>: Automatic numbering.</li>\n                    <li><strong>Diameter (mm)</strong>: Directly enter the outer diameter of this special wire (including the insulation layer).</li>\n                    <li><strong>Quantity</strong>: Enter the quantity of this special wire.</li>\n                    <li><strong>Delete</strong>: Click the \"<span class=\"emoji\">❌</span>\" button to delete this row of wires.</li>\n                </ul>\n                <h5>Operation Buttons:</h5>\n                <ul>\n                    <li><strong><span class=\"emoji\">✨</span> Add</strong>: Click to add a new special wire input row.</li>\n                    <li><strong><span class=\"emoji\">🔄</span> Reset</strong>: Click to clear all special wire inputs.</li>\n                </ul>\n                <h5>How to use:</h5>\n                <ol>\n                    <li>Click the \"<span class=\"emoji\">✨</span> Add\" button to add a wire row.</li>\n                    <li>Enter the actual outer diameter of the wire in the \"Diameter (mm)\" column.</li>\n                    <li>Enter the number of this wire in the \"Quantity\" column.</li>\n                </ol>\n            ",
  "section3-2-3_title": "<span class=\"emoji\">🛡️</span> Wrappings",
  "section3-2-3_content": "\n                <p>This area is used to define the outer wrapping layers of the wire bundle, such as tape, tubing, etc. Wrappings will increase the final diameter of the wire bundle.</p>\n                <h5>Table Column Description:</h5>\n                <ul>\n                    <li><strong>No.</strong>: Automatic numbering, representing the order of the wrapping layers (from inside to outside).</li>\n                    <li><strong>Thickness (mm)</strong>: Enter the single-sided thickness of this layer of wrapping.</li>\n                    <li><strong>Delete</strong>: Click the \"<span class=\"emoji\">❌</span>\" button to delete this row of wrapping.</li>\n                </ul>\n                <h5>Operation Buttons:</h5>\n                <ul>\n                    <li><strong><span class=\"emoji\">✨</span> Add</strong>: Click to add a new wrapping layer input.</li>\n                    <li><strong><span class=\"emoji\">🔄</span> Reset</strong>: Click to clear all wrapping inputs.</li>\n                </ul>\n                <h5>How to use:</h5>\n                <ol>\n                    <li>If the wire bundle has multiple layers of wrapping, start from the innermost layer and click the \"<span class=\"emoji\">✨</span> Add\" button to add them layer by layer.</li>\n                    <li>Enter the thickness of this layer of wrapping in the \"Thickness (mm)\" column of each row.</li>\n                </ol>\n            ",
  "section3-2-4_title": "<span class=\"emoji\">📐</span> Manufacturing Tolerance",
  "section3-2-4_content": "\n                <p>Considering various factors in actual production, the actual diameter of the wire bundle is usually slightly larger than the theoretical calculated value. A magnification factor can be set here.</p>\n                <h5>Slider and Input Box:</h5>\n                <p>You can adjust the manufacturing tolerance by dragging the slider or directly entering a percentage in the input box.</p>\n                <ul>\n                    <li>The range is 100% to 200%. For example, entering 110% means that the final calculated diameter will be increased by another 10% on the basis of the theoretical value (including wrappings).</li>\n                    <li>The default value is 110%.</li>\n                </ul>\n                <h5>Operation Buttons:</h5>\n                <ul>\n                    <li><strong><span class=\"emoji\">🔄</span> Reset</strong>: Click to restore the manufacturing tolerance to the default value (110%).</li>\n                </ul>\n            ",
  "section3-2-5_title": "<span class=\"emoji\">🧮</span> Number of Calculations",
  "section3-2-5_content": "\n                <p>This tool uses the Monte Carlo simulation method to estimate the wire bundle diameter, which means it will perform multiple random wire stacking simulations and then take the statistical results.</p>\n                <h5>Slider and Input Box:</h5>\n                <p>You can adjust the number of simulation calculations by dragging the slider or directly entering the number in the input box.</p>\n                <ul>\n                    <li>The range is 1 to 100 times. The more times, the closer the result may be to the average of the real situation, but the calculation time will also increase accordingly.</li>\n                    <li>The default value is 10 times.</li>\n                </ul>\n                <h5>Operation Buttons:</h5>\n                <ul>\n                    <li><strong><span class=\"emoji\">🔄</span> Reset</strong>: Click to restore the number of calculations to the default value (10).</li>\n                </ul>\n            ",
  "section3-3_title": "Bottom: Operation Control Bar",
  "section3-3_content": "\n                <ul>\n                    <li><strong>Save History (Checkbox)</strong>:\n                        <p>Checked by default. When checked, every time you click \"<span class=\"emoji\">📏</span> Calculate Diameter\", the current input parameters and calculation results will be automatically saved to the \"History\" page for future reference.</p>\n                        <p>If you do not want to save automatically, you can uncheck it.</p>\n                    </li>\n                    <li><strong><span class=\"emoji\">🧹</span> Reset All (Button)</strong>:\n                        <p>Clicking this button will restore all input items on the entire \"Calculate\" page (standard wires, special wires, wrappings, manufacturing tolerance, number of calculations) to their initial default state.</p>\n                    </li>\n                    <li><strong><span class=\"emoji\">📏</span> Calculate Diameter (Button)</strong>:\n                        <p>This is the most important operation button. After you have finished entering all the parameters, click this button and the plugin will start to perform the simulation calculation of the wire bundle diameter.</p>\n                        <p>After the calculation is complete, the results will be displayed in the result display area on the right side of the page.</p>\n                        <p>You can also directly press the <code>Enter</code> key on your keyboard to trigger the calculation.</p>\n                    </li>\n                </ul>\n            ",
  "section3-4_title": "Right: Result Display Area",
  "section3-4_p1": "When you click the \"<span class=\"emoji\">📏</span> Calculate Diameter\" button, the calculation results will be displayed here.",
  "section3-4-1_title": "<span class=\"emoji\">🖼️</span> Cross-section Simulation Diagram",
  "section3-4-1_content": "\n                <ul>\n                    <li><strong>Canvas</strong>: A typical cross-section diagram of a wire bundle based on the wires you entered will be displayed here after random stacking. Wires of different diameters will be represented by different colors.</li>\n                    <li><strong>Legend</strong>: There will be a legend next to or below the canvas, explaining which diameter of wire the different colors in the cross-section diagram correspond to.</li>\n                    <li><strong>Inner Container Boundary</strong>: There may be a dashed circle in the figure, which represents the theoretical wire bundle boundary formed by the stacking of all wires (excluding wrappings and tolerances).</li>\n                </ul>\n            ",
  "section3-4-2_title": "<span class=\"emoji\">✨</span> Highlighted Final Average Diameter",
  "section3-4-2_content": "\n                <p>In the cross-section simulation diagram area, there will be a prominently displayed value, for example, \"<strong>Ø 12.3 mm</strong>\".</p>\n                <p>This represents the <strong>final average diameter</strong>, which is the estimated diameter value obtained by rounding up after comprehensively considering all wires, all wrapping layer thicknesses, and the manufacturing tolerance you set. The value in parentheses usually shows a more precise calculated value (e.g., reserved to two decimal places).</p>\n            ",
  "section3-4-3_title": "<span class=\"emoji\">⚙️</span> Input Statistics",
  "section3-4-3_content": "\n                <p>Here are some key parameters you are currently entering:</p>\n                <ul>\n                    <li><strong>Total number of wires</strong>: The total number of wires you entered in \"Standard Wires\" and \"Special Wires\".</li>\n                    <li><strong>Total number of wrapping layers</strong>: The total number of wrapping layers you entered in the \"Wrappings\" area.</li>\n                    <li><strong>Total wrapping thickness</strong>: The sum of the thicknesses of all wrapping layers (single-sided).</li>\n                </ul>\n            ",
  "section3-4-4_title": "<span class=\"emoji\">📈</span> Diameter Calculation Details",
  "section3-4-4_content": "\n                <p>This is a table showing more detailed diameter calculation results:</p>\n                <h5>Parameters:</h5>\n                <ul>\n                    <li><strong>Minimum wire diameter</strong>: The minimum wire bundle diameter obtained from multiple simulations.</li>\n                    <li><strong>Maximum wire diameter</strong>: The maximum wire bundle diameter obtained from multiple simulations.</li>\n                    <li><strong>Average wire diameter</strong>: The average wire bundle diameter of multiple simulation results.</li>\n                </ul>\n                <h5>Bare wire value (mm):</h5>\n                <p>This column shows the minimum, maximum, and average values of the theoretical diameter obtained by multiple stacking simulations based on <strong>the wire itself</strong> (without any wrappings and manufacturing tolerances).</p>\n                <h5>Simulated value (mm):</h5>\n                <p>This column shows the <strong>final calculated diameter</strong>, which is the diameter obtained by adding the total thickness of all wrapping layers (double-sided) to the \"bare wire value\" and applying the \"manufacturing tolerance\" percentage you set. These values are usually the final results you are more concerned about.</p>\n            ",
  "section3-4-5_title": "<span class=\"emoji\">📊</span> Calculation Result Distribution Chart",
  "section3-4-5_content": "\n                <p>This is a histogram showing the frequency distribution of different diameter results in multiple simulation calculations.</p>\n                <ul>\n                    <li><strong>Horizontal axis (X-axis)</strong>: Wire bundle diameter (mm).</li>\n                    <li><strong>Vertical axis (Y-axis)</strong>: Frequency (number of occurrences).</li>\n                    <li>This can help you intuitively understand the stability and central tendency of the calculation results. If the distribution is wide, it means that the results fluctuate greatly.</li>\n                </ul>\n            ",
  "section3-5_title": "Quick Calculation Example",
  "section3-5_content": "\n                <p>Suppose you need to calculate a wire bundle composed of the following components:</p>\n                <ul>\n                    <li>10 thin-walled wires of 0.5 mm²</li>\n                    <li>5 thick-walled wires of 1.5 mm²</li>\n                    <li>2 special wires with an outer diameter of 2.8 mm</li>\n                    <li>Wrapped with a layer of tape with a thickness of 0.13 mm</li>\n                    <li>Manufacturing tolerance is calculated at 112%</li>\n                    <li>Perform 20 simulation calculations</li>\n                </ul>\n                <p>The operation steps are as follows:</p>\n                <ol>\n                    <li>In the <strong>Standard Wires</strong> area, add two rows. In the first row, select wire gauge <code>0.5</code>, type <code>Thin</code>, and enter quantity <code>10</code>. In the second row, select wire gauge <code>1.5</code>, type <code>Thick</code>, and enter quantity <code>5</code>.</li>\n                    <li>In the <strong>Special Wires</strong> area, add a row. Enter diameter <code>2.8</code> and quantity <code>2</code>.</li>\n                    <li>In the <strong>Wrappings</strong> area, add a row. Enter thickness <code>0.13</code>.</li>\n                    <li>In the <strong>Manufacturing Tolerance</strong> area, adjust the slider or input value to <code>112%</code>.</li>\n                    <li>In the <strong>Number of Calculations</strong> area, adjust the slider or input value to <code>20</code>.</li>\n                    <li>Make sure the <strong>Save History</strong> checkbox is checked.</li>\n                    <li>Click the <strong><span class=\"emoji\">📏</span> Calculate Diameter</strong> button at the bottom.</li>\n                    <li>After a short while, the right side will display the detailed calculation results and cross-section simulation diagram.</li>\n                </ol>\n            ",
  "section4_title": "4. View and Manage Calculation History (<code>History</code> Page)",
  "section4_content": "\n                <p>Every time you enable \"Save History\" and perform a calculation on the \"Calculate\" page, a complete snapshot of that calculation will be saved here.</p>\n                <img src=\"./assets/img3.jpg\" alt=\"History page diagram\">\n                <h5>Main functions:</h5>\n                <ul>\n                    <li><strong>History List</strong>:\n                        <p>Each record contains the timestamp of the calculation, the final estimated diameter, and a brief summary of the input parameters.</p>\n                    </li>\n                    <li><strong>Operation Buttons</strong>:\n                        <ul>\n                            <li><strong><span class=\"emoji\">🔍</span> Details</strong>: Click to view the complete input parameters and calculation results of this historical record, which are completely consistent with the results seen on the right side of the \"Calculate\" page at that time.</li>\n                            <li><strong><span class=\"emoji\">🔄</span> Load to Calculation Page</strong>: Click this button to fully load all the input parameters of this historical record (including wires, wrappings, tolerances, etc.) back to the \"Calculate\" page, which is convenient for you to fine-tune and recalculate based on past calculations.</li>\n                            <li><strong><span class=\"emoji\">❌</span> Delete</strong>: Click to delete this historical record.</li>\n                            <li><strong><span class=\"emoji\">🗑️</span> Delete All</strong>: Located at the top of the history list, click to clear all historical records at once.</li>\n                        </ul>\n                    </li>\n                </ul>\n            ",
  "section5_title": "5. Plugin Configuration (<code>Config</code> Page)",
  "section5_content": "\n                <p>Here, you can customize the behavior and parameters of the plugin to better suit your workflow.</p>\n                <img src=\"./assets/img4.jpg\" alt=\"Configuration page diagram\">\n                <h5>Main configuration items:</h5>\n                <ul>\n                    <li><strong>Standard Wire Specification Management</strong>:\n                        <p>This is the core of the configuration page. You can view, modify, add, or delete preset \"Standard Wire\" specifications.</p>\n                        <ul>\n                            <li>You can adjust the nominal outer diameter of existing specifications, or add new insulation layer types for a certain wire gauge (for example, \"FLR-B\" type).</li>\n                            <li>Manage the entire specification list through the \"Add\" and \"Delete\" buttons.</li>\n                            <li>Click \"Restore Default Settings\" to reset the wire specification table to the state when the plugin was initially installed.</li>\n                        </ul>\n                    </li>\n                    <li><strong>Default Calculation Parameters</strong>:\n                        <p>You can modify the default values when the \"Calculate\" page is opened, for example:</p>\n                        <ul>\n                            <li>Default manufacturing tolerance percentage.</li>\n                            <li>Default number of simulation calculations.</li>\n                        </ul>\n                    </li>\n                    <li><strong>Data Management</strong>:\n                        <ul>\n                            <li><strong>Export Configuration</strong>: Export all your current configurations (including custom wire specifications and default parameters) to a <code>.json</code> file.</li>\n                            <li><strong>Import Configuration</strong>: By selecting a previously exported <code>.json</code> file, you can quickly rest",
  "section6_title": "6. View Version and Changelog",
  "section6_content": "\n                <p>At the bottom of the main interface sidebar, you will see the current version number of the plugin, for example <code>Version: 1.0.2.2</code>.</p>\n                <p><strong>Click this version number</strong>, and a window will pop up showing the detailed changelog. This can help you understand what new features have been added or what problems have been fixed in each version.</p>\n                <img src=\"./assets/img5.jpg\" alt=\"Changelog diagram\">\n            "
  ,
  "section7_title": "7. Language and Internationalization",
  "section7_content": "\n                <p>The plugin supports Chinese and English display.</p>\n                <h5>How to switch language:</h5>\n                <ul>\n                    <li>Click the language button at the bottom-right of the main interface and choose <code>中文</code> or <code>English</code>.</li>\n                    <li>After switching, the page text updates automatically—no manual refresh needed.</li>\n                </ul>\n                <img src=\"./assets/img6.jpg\" alt=\"Language switch diagram\">\n                <h5>Terminology note:</h5>\n                <p>Common terms have simple explanations in the \"Glossary\" section for easy understanding.</p>\n            ",
  "section8_title": "8. Viewing and Sharing Results (Export Image)",
  "section8_content": "\n                <p>You can save the results page as an image for sharing or archiving.</p>\n                <h5>How to do it:</h5>\n                <ol>\n                    <li>On the \"Calculate\" page, finish setting parameters and click \"Calculate Diameter\".</li>\n                    <li>Click \"Export Image\" in the results area (if available).</li>\n                    <li>Choose a save location to get the image.</li>\n                </ol>\n                <img src=\"./assets/img7.jpg\" alt=\"Export image flow diagram\">\n                <h5>Tips:</h5>\n                <ul>\n                    <li>Make sure the needed information is visible on screen; the saved image will be clearer.</li>\n                    <li>If the image looks blurry, try enlarging the window or exporting again.</li>\n                </ul>\n            "
  ,
  "section9_title": "9. Frequently Asked Questions (FAQ)",
  "section9_content": "\n                <h5>1) No main interface after installation?</h5>\n                <p>Enter <code>edge://extensions/</code> in Edge, enable \"Developer Mode\", and ensure the plugin directory containing <code>manifest.json</code> is loaded. If the interface is abnormal, click \"Refresh\".</p>\n                <h5>2) Calculate button not responding or Enter key not triggering?</h5>\n                <p>Check whether parameters are complete; try clicking outside the input box and then press Enter. If still invalid, refresh the extension window.</p>\n                <h5>3) Exported screenshot is blurry or blank?</h5>\n                <p>Ensure the results area is within the visible range; turn off \"Simplified UI/High Contrast\" mode and retry; adjust window size if necessary.</p>\n                <h5>4) Configuration import failed?</h5>\n                <p>Confirm that the imported <code>.json</code> structure is version-compatible; when migrating from older versions, \"Restore Default Settings\" first, then import step-by-step.</p>\n                <h5>5) Search returns no result or only hits titles?</h5>\n                <p>Try shorter keywords (e.g., \"wire\", \"tolerance\"); newly added content will be included in the search index after refresh.</p>\n            ",
  "section10_title": "10. Glossary",
  "section10_content": "\n                <ul>\n                    <li><strong>Wire</strong>: A single cable with outer protection.</li>\n                    <li><strong>Bundle</strong>: A group of multiple wires combined together.</li>\n                    <li><strong>Insulation</strong>: Protective outer layer of a wire, affecting size.</li>\n                    <li><strong>Tolerance</strong>: Natural size deviation to better match reality.</li>\n                    <li><strong>Legend</strong>: Explanation of colors and categories in charts.</li>\n                    <li><strong>Gauge</strong>: Nominal cross-sectional area (e.g., 0.5, 1.5 mm²) used to classify wires.</li>\n                    <li><strong>Wrappings</strong>: Outer layers such as tape or tubing applied around the bundle, increasing final diameter.</li>\n                    <li><strong>Thin / Thick / Ultra Thin</strong>: Common insulation types indicating wall thickness of the wire (thin-walled / thick-walled / ultra-thin).</li>\n                </ul>\n            "
}
